import { MessageEmbed } from 'discord.js';
import clientFactory from '#root/client'

clientFactory(client => {
	client.on('ready', async () => {
		const guild = client.guilds.cache.first();
		const channel = guild.channels.cache.find((c) => c.id == '996806556303773736'); // Канал із навігацією

		const embedChannelsInfo = new MessageEmbed()
			.setDescription(`
			\`\`\`
					Текстові канали \`\`\`
				Перед вами список публічних текстових каналів.
				Додатково можуть бути утворені приватні канали доступ до яких, можна отримати після вибору ролі.
					
			**~$:⑊** 
			┠── **⑊SYS**
			┠──╂─ <#996800965137141840> — правила сервера.
			┠──╂─ <#996713034359767100> — ролі на вибір.
			┠──╂─ <#996806556303773736> — навігація на сервері.
			┠──╂─ <#932740664280612934> — оголошення сервера.
			┠──┸─ <#996441927148896377> — парнтери сервера.
			┠── **⑊LIB**
			┠──╂─ <#987339459022450709> — новини із світу IT.
			┠──╂─ <#991753966297825362> — вакансії усіх рівней.
			┠── **⑊USR**
			┠──╂─ <#982234040528666674> — міні біографії учасників.
			┠──╂─ <#992101532550049832> — проєкти часників.
			┠──╂─ <#983280185971466260> — фото робочих місць учасниців.
			┠──┸─ <#983391783163687012> — інші девайси учасників.
			┠── **⑊ROOT**
			┠──╂─ <#932734831358541910> — основний чат.
			┠──╂─ <#932734831358541911> — канал для ваших пропозицій.
			┠──╂─ <#932734831358541912> — nsfw та оффтоп канал.
			┠──╂─ <#988174139418378260> — меми про IT.
			┖──┸─ <#997135512848568391> — обговорення війни із 𝗉осією.

		`);

		const messageChannelsInfo = await channel.messages.fetch('997184029952577616'); //Існуюче повідомлення із навігацією
		messageChannelsInfo.edit({ embeds: [embedChannelsInfo] });
		process.exit(1)
	});
})
