export default [
  {
    messageId: "1015305782042046504",
    embed: {
      "title": "",
      "description": `
      Друзі, <@&996802778519326730> , ми б хотіли порекомендувати вам сервер нашого друга **IT-Садок**!
        В **IT-Садок** ви зможете отримати професійну допомогу із усіма вашими питаннями початківців у сфері ІТ.
        Дружня команда адміністрації завжди готова вам підсказати та розповісти що так як із тим *нашим* программуванням <:awesome:1007999120272797766>.
      `
    },
    invite: "https://discord.gg/vGDyRGXVcy"
  }
]
