export default {
    "content": null,
    "embeds": [
        {
            "title": "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ 📜 Правила спільноти ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
            "description":"```\nДля того, щоб не отримати покарання — ми просимо усіх учасників спільноти прочитати та погодитися із правилами поведінки на сервері.\n```"
        },
      {
        "title": "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ Пункт правила — #0 ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "description": "**Опис**\n```\nЗаборонено вживати російску мову, поширювати контент російскою, та поширювати посилання із російським доменом.\n```",
        "color": null,
        "fields": [
          {
            "name": "Покарання",
            "value": "```\nБан\n```",
            "inline": true
          },
          {
            "name": "Тривалість",
            "value": "```\nНа розсуд адміністрації\n```",
            "inline": true
          }
        ]
      },
      {
        "title": "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ Пункт правила — #1 ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "description": "**Опис**\n```\nСпілкуйтеся ввічливо. Категорично заборонені агресія, полювання на відьом, расистські, сексистські та ксенофобські висловлювання. (окрім московії та її фауни).\n```",
        "color": null,
        "fields": [
          {
            "name": "Покарання",
            "value": "```\nБан\n```",
            "inline": true
          },
          {
            "name": "Тривалість",
            "value": "```\nНазавжди\n```",
            "inline": true
          }
        ]
      },
      {
        "title": "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ Пункт правила — #2 ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "description": "**Опис**\n```\nЗаборонений спам та самореклама (запрошення на сервер, рекламні оголошення тощо) без дозволу з боку керівництва, зокрема в приватних повідомленнях.\n```",
        "color": null,
        "fields": [
          {
            "name": "Покарання",
            "value": "```\nБан\n```",
            "inline": true
          },
          {
            "name": "Тривалість",
            "value": "```\nНа розсуд адміністрації\n```",
            "inline": true
          }
        ]
      },
      {
        "title": "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ Пункт правила — #3 ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "description": "**Опис**\n```\nКонтент з обмеженнями по віку та непристойний контент заборонені, зокрема тексти, зображення та посилання, що містять оголеність, секс, тяжке насилля чи інший провокативний контент (окрім каналів nsfw).\n```",
        "color": null,
        "fields": [
          {
            "name": "Покарання",
            "value": "```\nБан/Попередження\n```",
            "inline": true
          },
          {
            "name": "Тривалість",
            "value": "```\nНа розсуд адміністрації\n```",
            "inline": true
          }
        ]
      },
      {
        "title": "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ Пункт правила — #4 ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "description": "**Опис**\n```\nЗаборонено розповсюдження особистої інформації без згоди її власника.\n```",
        "color": null,
        "fields": [
          {
            "name": "Покарання",
            "value": "```\nБан/Попередження\n```",
            "inline": true
          },
          {
            "name": "Тривалість",
            "value": "```\nНа розсуд адміністрації\n```",
            "inline": true
          }
        ]
      },
      {
        "title": "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ Пункт правила — #5 ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "description": "**Опис**\n```\nЯкщо на розсуд адміністрації, ваші дії можуть шкодити серверу або завдати будь-якої шкоди учасникам, а також перешкоджати їх спілкуванню, то адміністрація має право видати вам покарання.\n```",
        "color": null,
        "fields": [
          {
            "name": "Покарання",
            "value": "```\nБан/Попередження\n```",
            "inline": true
          },
          {
            "name": "Тривалість",
            "value": "```\nНа розсуд адміністрації\n```",
            "inline": true
          }
        ]
      },
      {
        "title": "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ Пункт правила — #6 ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "description": "**Опис**\n```\nЗаборонені некоректні дії щодо сервера: неконструктивна критика у бік модерації; вказувати адміністраї та модераторам, що,як і коли їм виконувати; спроби обману, що до адміністрації або будь-які інші дії, які можуть призвести до перешкод у процесі розвитку сервера.\n```",
        "color": null,
        "fields": [
          {
            "name": "Покарання",
            "value": "```\nБан/Попередження\n```",
            "inline": true
          },
          {
            "name": "Тривалість",
            "value": "```\nНа розсуд адміністрації\n```",
            "inline": true
          }
        ]
      },
      {
        "title": "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ Пункт правила — #7 ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
        "description": "**Опис**\n```\nЗабороняється капс, спам, флуд у будь-яких його проявах.\n```",
        "color": null,
        "fields": [
          {
            "name": "Покарання",
            "value": "```\nБан/Попередження\n```",
            "inline": true
          },
          {
            "name": "Тривалість",
            "value": "```\nНа розсуд адміністрації\n```",
            "inline": true
          }
        ]
      }
    ],
    "attachments": []
  }